Network Info Summary
=======================================================================================================
Layer (type)                  Output Shape             Param          Memory Usage(data, param)
-------------------------------------------------------------------------------------------------------
input (Input)                 (1, 368, 368, 3)         0              396.8 KiB (396.8 KiB, 0 Bytes)
-------------------------------------------------------------------------------------------------------
conv1_1 (Convolution)         (1, 368, 368, 64)        1792           33.1 MiB (33.1 MiB, 7.0 KiB)
-------------------------------------------------------------------------------------------------------
conv1_2 (Convolution)         (1, 368, 368, 64)        36928          33.2 MiB (33.1 MiB, 144.2 KiB)
-------------------------------------------------------------------------------------------------------
pool1 (Pooling)               (1, 184, 184, 64)        0              8.3 MiB (8.3 MiB, 0 Bytes)
-------------------------------------------------------------------------------------------------------
conv2_1 (Convolution)         (1, 184, 184, 128)       73856          16.8 MiB (16.5 MiB, 288.5 KiB)
-------------------------------------------------------------------------------------------------------
conv2_2 (Convolution)         (1, 184, 184, 128)       147584         17.1 MiB (16.5 MiB, 576.5 KiB)
-------------------------------------------------------------------------------------------------------
pool2 (Pooling)               (1, 92, 92, 128)         0              4.1 MiB (4.1 MiB, 0 Bytes)
-------------------------------------------------------------------------------------------------------
conv3_1 (Convolution)         (1, 92, 92, 256)         295168         9.4 MiB (8.3 MiB, 1.1 MiB)
-------------------------------------------------------------------------------------------------------
conv3_2 (Convolution)         (1, 92, 92, 256)         590080         10.5 MiB (8.3 MiB, 2.3 MiB)
-------------------------------------------------------------------------------------------------------
conv3_3 (Convolution)         (1, 92, 92, 256)         590080         10.5 MiB (8.3 MiB, 2.3 MiB)
-------------------------------------------------------------------------------------------------------
conv3_4 (Convolution)         (1, 92, 92, 256)         590080         10.5 MiB (8.3 MiB, 2.3 MiB)
-------------------------------------------------------------------------------------------------------
pool3 (Pooling)               (1, 46, 46, 256)         0              2.1 MiB (2.1 MiB, 0 Bytes)
-------------------------------------------------------------------------------------------------------
conv4_1 (Convolution)         (1, 46, 46, 512)         1180160        8.6 MiB (4.1 MiB, 4.5 MiB)
-------------------------------------------------------------------------------------------------------
conv4_2 (Convolution)         (1, 46, 46, 512)         2359808        13.1 MiB (4.1 MiB, 9.0 MiB)
-------------------------------------------------------------------------------------------------------
conv4_3 (Convolution)         (1, 46, 46, 256)         1179904        6.6 MiB (2.1 MiB, 4.5 MiB)
-------------------------------------------------------------------------------------------------------
conv4_4 (Convolution)         (1, 46, 46, 128)         295040         2.2 MiB (1.0 MiB, 1.1 MiB)
-------------------------------------------------------------------------------------------------------
conv5_1_l (Convolution)       (1, 46, 46, 128)         147584         1.6 MiB (1.0 MiB, 576.5 KiB)
-------------------------------------------------------------------------------------------------------
conv5_2_l (Convolution)       (1, 46, 46, 128)         147584         1.6 MiB (1.0 MiB, 576.5 KiB)
-------------------------------------------------------------------------------------------------------
conv5_3_l (Convolution)       (1, 46, 46, 128)         147584         1.6 MiB (1.0 MiB, 576.5 KiB)
-------------------------------------------------------------------------------------------------------
conv5_4_l (Convolution)       (1, 46, 46, 512)         66048          4.4 MiB (4.1 MiB, 258.0 KiB)
-------------------------------------------------------------------------------------------------------
conv5_5_l (Convolution)       (1, 46, 46, 38)          19494          390.2 KiB (314.1 KiB, 76.1 KiB)
-------------------------------------------------------------------------------------------------------
conv5_1_r (Convolution)       (1, 46, 46, 128)         43904          1.2 MiB (1.0 MiB, 171.5 KiB)
-------------------------------------------------------------------------------------------------------
conv5_2_r (Convolution)       (1, 46, 46, 128)         147584         1.6 MiB (1.0 MiB, 576.5 KiB)
-------------------------------------------------------------------------------------------------------
conv5_3_r (Convolution)       (1, 46, 46, 128)         147584         1.6 MiB (1.0 MiB, 576.5 KiB)
-------------------------------------------------------------------------------------------------------
conv5_4_r (Convolution)       (1, 46, 46, 512)         66048          4.4 MiB (4.1 MiB, 258.0 KiB)
-------------------------------------------------------------------------------------------------------
conv5_5_r (Convolution)       (1, 46, 46, 19)          9747           195.1 KiB (157.0 KiB, 38.1 KiB)
-------------------------------------------------------------------------------------------------------
concat_stage2 (Concat)        (1, 46, 46, 185)         0              1.5 MiB (1.5 MiB, 0 Bytes)
-------------------------------------------------------------------------------------------------------
conv1_stage2_l (Convolution)  (1, 46, 46, 128)         1160448        5.5 MiB (1.0 MiB, 4.4 MiB)
-------------------------------------------------------------------------------------------------------
conv2_stage2_l (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv3_stage2_l (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv4_stage2_l (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv5_stage2_l (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv6_stage2_l (Convolution)  (1, 46, 46, 128)         16512          1.1 MiB (1.0 MiB, 64.5 KiB)
-------------------------------------------------------------------------------------------------------
conv7_stage2_l (Convolution)  (1, 46, 46, 38)          4902           333.2 KiB (314.1 KiB, 19.1 KiB)
-------------------------------------------------------------------------------------------------------
conv1_stage2_r (Convolution)  (1, 46, 46, 128)         238464         1.9 MiB (1.0 MiB, 931.5 KiB)
-------------------------------------------------------------------------------------------------------
conv2_stage2_r (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv3_stage2_r (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv4_stage2_r (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv5_stage2_r (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv6_stage2_r (Convolution)  (1, 46, 46, 128)         16512          1.1 MiB (1.0 MiB, 64.5 KiB)
-------------------------------------------------------------------------------------------------------
conv7_stage2_r (Convolution)  (1, 46, 46, 19)          2451           166.6 KiB (157.0 KiB, 9.6 KiB)
-------------------------------------------------------------------------------------------------------
concat_stage3 (Concat)        (1, 46, 46, 185)         0              1.5 MiB (1.5 MiB, 0 Bytes)
-------------------------------------------------------------------------------------------------------
conv1_stage3_l (Convolution)  (1, 46, 46, 128)         1160448        5.5 MiB (1.0 MiB, 4.4 MiB)
-------------------------------------------------------------------------------------------------------
conv2_stage3_l (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv3_stage3_l (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv4_stage3_l (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv5_stage3_l (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv6_stage3_l (Convolution)  (1, 46, 46, 128)         16512          1.1 MiB (1.0 MiB, 64.5 KiB)
-------------------------------------------------------------------------------------------------------
conv7_stage3_l (Convolution)  (1, 46, 46, 38)          4902           333.2 KiB (314.1 KiB, 19.1 KiB)
-------------------------------------------------------------------------------------------------------
conv1_stage3_r (Convolution)  (1, 46, 46, 128)         238464         1.9 MiB (1.0 MiB, 931.5 KiB)
-------------------------------------------------------------------------------------------------------
conv2_stage3_r (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv3_stage3_r (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv4_stage3_r (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv5_stage3_r (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv6_stage3_r (Convolution)  (1, 46, 46, 128)         16512          1.1 MiB (1.0 MiB, 64.5 KiB)
-------------------------------------------------------------------------------------------------------
conv7_stage3_r (Convolution)  (1, 46, 46, 19)          2451           166.6 KiB (157.0 KiB, 9.6 KiB)
-------------------------------------------------------------------------------------------------------
concat_stage4 (Concat)        (1, 46, 46, 185)         0              1.5 MiB (1.5 MiB, 0 Bytes)
-------------------------------------------------------------------------------------------------------
conv1_stage4_l (Convolution)  (1, 46, 46, 128)         1160448        5.5 MiB (1.0 MiB, 4.4 MiB)
-------------------------------------------------------------------------------------------------------
conv2_stage4_l (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv3_stage4_l (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv4_stage4_l (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv5_stage4_l (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv6_stage4_l (Convolution)  (1, 46, 46, 128)         16512          1.1 MiB (1.0 MiB, 64.5 KiB)
-------------------------------------------------------------------------------------------------------
conv7_stage4_l (Convolution)  (1, 46, 46, 38)          4902           333.2 KiB (314.1 KiB, 19.1 KiB)
-------------------------------------------------------------------------------------------------------
conv1_stage4_r (Convolution)  (1, 46, 46, 128)         238464         1.9 MiB (1.0 MiB, 931.5 KiB)
-------------------------------------------------------------------------------------------------------
conv2_stage4_r (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv3_stage4_r (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv4_stage4_r (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv5_stage4_r (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv6_stage4_r (Convolution)  (1, 46, 46, 128)         16512          1.1 MiB (1.0 MiB, 64.5 KiB)
-------------------------------------------------------------------------------------------------------
conv7_stage4_r (Convolution)  (1, 46, 46, 19)          2451           166.6 KiB (157.0 KiB, 9.6 KiB)
-------------------------------------------------------------------------------------------------------
concat_stage5 (Concat)        (1, 46, 46, 185)         0              1.5 MiB (1.5 MiB, 0 Bytes)
-------------------------------------------------------------------------------------------------------
conv1_stage5_l (Convolution)  (1, 46, 46, 128)         1160448        5.5 MiB (1.0 MiB, 4.4 MiB)
-------------------------------------------------------------------------------------------------------
conv2_stage5_l (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv3_stage5_l (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv4_stage5_l (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv5_stage5_l (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv6_stage5_l (Convolution)  (1, 46, 46, 128)         16512          1.1 MiB (1.0 MiB, 64.5 KiB)
-------------------------------------------------------------------------------------------------------
conv7_stage5_l (Convolution)  (1, 46, 46, 38)          4902           333.2 KiB (314.1 KiB, 19.1 KiB)
-------------------------------------------------------------------------------------------------------
conv1_stage5_r (Convolution)  (1, 46, 46, 128)         238464         1.9 MiB (1.0 MiB, 931.5 KiB)
-------------------------------------------------------------------------------------------------------
conv2_stage5_r (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv3_stage5_r (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv4_stage5_r (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv5_stage5_r (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv6_stage5_r (Convolution)  (1, 46, 46, 128)         16512          1.1 MiB (1.0 MiB, 64.5 KiB)
-------------------------------------------------------------------------------------------------------
conv7_stage5_r (Convolution)  (1, 46, 46, 19)          2451           166.6 KiB (157.0 KiB, 9.6 KiB)
-------------------------------------------------------------------------------------------------------
concat_stage6 (Concat)        (1, 46, 46, 185)         0              1.5 MiB (1.5 MiB, 0 Bytes)
-------------------------------------------------------------------------------------------------------
conv1_stage6_l (Convolution)  (1, 46, 46, 128)         1160448        5.5 MiB (1.0 MiB, 4.4 MiB)
-------------------------------------------------------------------------------------------------------
conv2_stage6_l (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv3_stage6_l (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv4_stage6_l (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv5_stage6_l (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv6_stage6_l (Convolution)  (1, 46, 46, 128)         16512          1.1 MiB (1.0 MiB, 64.5 KiB)
-------------------------------------------------------------------------------------------------------
conv7_stage6_l (Convolution)  (1, 46, 46, 38)          4902           333.2 KiB (314.1 KiB, 19.1 KiB)
-------------------------------------------------------------------------------------------------------
conv1_stage6_r (Convolution)  (1, 46, 46, 128)         238464         1.9 MiB (1.0 MiB, 931.5 KiB)
-------------------------------------------------------------------------------------------------------
conv2_stage6_r (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv3_stage6_r (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv4_stage6_r (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv5_stage6_r (Convolution)  (1, 46, 46, 128)         802944         4.1 MiB (1.0 MiB, 3.1 MiB)
-------------------------------------------------------------------------------------------------------
conv6_stage6_r (Convolution)  (1, 46, 46, 128)         16512          1.1 MiB (1.0 MiB, 64.5 KiB)
-------------------------------------------------------------------------------------------------------
conv7_stage6_r (Convolution)  (1, 46, 46, 19)          2451           166.6 KiB (157.0 KiB, 9.6 KiB)
-------------------------------------------------------------------------------------------------------
Total params: 47,597,846
Total memory usage: 426.7 MiB (data: 245.2 MiB, param: 181.6 MiB)
=======================================================================================================
