Network Info Summary
=======================================================================================================
Layer (type)                  Output Shape             Param          Memory Usage(data, param)
-------------------------------------------------------------------------------------------------------
input (Input)                 (32, 84, 84, 4)          0              3.4 MiB (3.4 MiB, 0 Bytes)
-------------------------------------------------------------------------------------------------------
conv1 (Convolution)           (32, 20, 20, 32)         8224           1.6 MiB (1.6 MiB, 32.1 KiB)
-------------------------------------------------------------------------------------------------------
relu1 (Activation)            (32, 20, 20, 32)         0              1.6 MiB (1.6 MiB, 0 Bytes)
-------------------------------------------------------------------------------------------------------
conv2 (Convolution)           (32, 9, 9, 64)           32832          776.2 KiB (648.0 KiB, 128.2 KiB)
-------------------------------------------------------------------------------------------------------
relu2 (Activation)            (32, 9, 9, 64)           0              648.0 KiB (648.0 KiB, 0 Bytes)
-------------------------------------------------------------------------------------------------------
conv3 (Convolution)           (32, 7, 7, 64)           36928          536.2 KiB (392.0 KiB, 144.2 KiB)
-------------------------------------------------------------------------------------------------------
relu3 (Activation)            (32, 7, 7, 64)           0              392.0 KiB (392.0 KiB, 0 Bytes)
-------------------------------------------------------------------------------------------------------
fc1 (Dense)                   (32, 512)                1606144        6.2 MiB (64.0 KiB, 6.1 MiB)
-------------------------------------------------------------------------------------------------------
relu4 (Activation)            (32, 512)                0              64.0 KiB (64.0 KiB, 0 Bytes)
-------------------------------------------------------------------------------------------------------
fc2 (Dense)                   (32, 6)                  3078           12.8 KiB (768 Bytes, 12.0 KiB)
-------------------------------------------------------------------------------------------------------
linear1 (Activation)          (32, 6)                  0              768 Bytes (768 Bytes, 0 Bytes)
-------------------------------------------------------------------------------------------------------
Total params: 1,687,206
Total memory usage: 15.2 MiB (data: 8.7 MiB, param: 6.4 MiB)
=======================================================================================================
