Network Info Summary
=======================================================================================================
Layer (type)                  Output Shape             Param          Memory Usage(data, param)
-------------------------------------------------------------------------------------------------------
input (Input)                 (1, 368, 368, 3)         0              396.8 KiB (396.8 KiB, 0 Bytes)
-------------------------------------------------------------------------------------------------------
conv1_1 (Convolution)         (1, 368, 368, 64)        1792           33.1 MiB (33.1 MiB, 7.0 KiB)
-------------------------------------------------------------------------------------------------------
relu1_1 (Activation)          (1, 368, 368, 64)        0              0 Bytes (0 Bytes, 0 Bytes)
-------------------------------------------------------------------------------------------------------
conv1_2 (Convolution)         (1, 368, 368, 64)        36928          33.2 MiB (33.1 MiB, 144.2 KiB)
-------------------------------------------------------------------------------------------------------
relu1_2 (Activation)          (1, 368, 368, 64)        0              0 Bytes (0 Bytes, 0 Bytes)
-------------------------------------------------------------------------------------------------------
pool1 (Pooling)               (1, 184, 184, 64)        0              8.3 MiB (8.3 MiB, 0 Bytes)
-------------------------------------------------------------------------------------------------------
conv2_1 (Convolution)         (1, 184, 184, 128)       73856          16.8 MiB (16.5 MiB, 288.5 KiB)
-------------------------------------------------------------------------------------------------------
relu2_1 (Activation)          (1, 184, 184, 128)       0              0 Bytes (0 Bytes, 0 Bytes)
-------------------------------------------------------------------------------------------------------
conv2_2 (Convolution)         (1, 184, 184, 128)       147584         17.1 MiB (16.5 MiB, 576.5 KiB)
-------------------------------------------------------------------------------------------------------
relu2_2 (Activation)          (1, 184, 184, 128)       0              0 Bytes (0 Bytes, 0 Bytes)
-------------------------------------------------------------------------------------------------------
pool2 (Pooling)               (1, 92, 92, 128)         0              4.1 MiB (4.1 MiB, 0 Bytes)
-------------------------------------------------------------------------------------------------------
conv3_1 (Convolution)         (1, 92, 92, 256)         295168         9.4 MiB (8.3 MiB, 1.1 MiB)
-------------------------------------------------------------------------------------------------------
relu3_1 (Activation)          (1, 92, 92, 256)         0              0 Bytes (0 Bytes, 0 Bytes)
-------------------------------------------------------------------------------------------------------
conv3_2 (Convolution)         (1, 92, 92, 256)         590080         10.5 MiB (8.3 MiB, 2.3 MiB)
-------------------------------------------------------------------------------------------------------
relu3_2 (Activation)          (1, 92, 92, 256)         0              0 Bytes (0 Bytes, 0 Bytes)
-------------------------------------------------------------------------------------------------------
conv3_3 (Convolution)         (1, 92, 92, 256)         590080         10.5 MiB (8.3 MiB, 2.3 MiB)
-------------------------------------------------------------------------------------------------------
relu3_3 (Activation)          (1, 92, 92, 256)         0              0 Bytes (0 Bytes, 0 Bytes)
-------------------------------------------------------------------------------------------------------
conv3_4 (Convolution)         (1, 92, 92, 256)         590080         10.5 MiB (8.3 MiB, 2.3 MiB)
-------------------------------------------------------------------------------------------------------
relu3_4 (Activation)          (1, 92, 92, 256)         0              0 Bytes (0 Bytes, 0 Bytes)
-------------------------------------------------------------------------------------------------------
pool3 (Pooling)               (1, 46, 46, 256)         0              2.1 MiB (2.1 MiB, 0 Bytes)
-------------------------------------------------------------------------------------------------------
conv4_1 (Convolution)         (1, 46, 46, 512)         1180160        8.6 MiB (4.1 MiB, 4.5 MiB)
-------------------------------------------------------------------------------------------------------
relu4_1 (Activation)          (1, 46, 46, 512)         0              0 Bytes (0 Bytes, 0 Bytes)
-------------------------------------------------------------------------------------------------------
conv4_2 (Convolution)         (1, 46, 46, 512)         2359808        13.1 MiB (4.1 MiB, 9.0 MiB)
-------------------------------------------------------------------------------------------------------
relu4_2 (Activation)          (1, 46, 46, 512)         0              0 Bytes (0 Bytes, 0 Bytes)
-------------------------------------------------------------------------------------------------------
conv4_3 (Convolution)         (1, 46, 46, 256)         1179904        6.6 MiB (2.1 MiB, 4.5 MiB)
-------------------------------------------------------------------------------------------------------
relu4_3 (Activation)          (1, 46, 46, 256)         0              0 Bytes (0 Bytes, 0 Bytes)
-------------------------------------------------------------------------------------------------------
conv4_4 (Convolution)         (1, 46, 46, 128)         295040         2.2 MiB (1.0 MiB, 1.1 MiB)
-------------------------------------------------------------------------------------------------------
relu4_4 (Activation)          (1, 46, 46, 128)         0              0 Bytes (0 Bytes, 0 Bytes)
-------------------------------------------------------------------------------------------------------
Total params: 7,340,480
Total memory usage: 186.5 MiB (data: 158.5 MiB, param: 28.0 MiB)
=======================================================================================================
