Network Info Summary
=======================================================================================================
Layer (type)                  Output Shape             Param          Memory Usage(data, param)
-------------------------------------------------------------------------------------------------------
input (Input)                 (1, 384, 256, 3)         0              1.1 MiB (1.1 MiB, 0 Bytes)
-------------------------------------------------------------------------------------------------------
conv1 (Convolution)           (1, 384, 256, 128)       3456           48.0 MiB (48.0 MiB, 13.5 KiB)
-------------------------------------------------------------------------------------------------------
pool1 (Pooling)               (1, 192, 128, 128)       0              12.0 MiB (12.0 MiB, 0 Bytes)
-------------------------------------------------------------------------------------------------------
conv2 (Convolution)           (1, 192, 128, 512)       589824         50.2 MiB (48.0 MiB, 2.2 MiB)
-------------------------------------------------------------------------------------------------------
pool2 (Pooling)               (1, 96, 64, 512)         0              12.0 MiB (12.0 MiB, 0 Bytes)
-------------------------------------------------------------------------------------------------------
conv3 (Convolution)           (1, 96, 64, 1024)        4718592        42.0 MiB (24.0 MiB, 18.0 MiB)
-------------------------------------------------------------------------------------------------------
pool3 (Pooling)               (1, 48, 32, 1024)        0              6.0 MiB (6.0 MiB, 0 Bytes)
-------------------------------------------------------------------------------------------------------
Total params: 5311872
Total memory usage: 171.4 MiB
=======================================================================================================
